/*! 
Требования
1. Все тензоры должны иметь:
- OID  = (Tensor, id) =  локальный идентификатор 32 бита со структурой SDNV, 
- name = строка 64 байта
- eTag = 64 бита (не проверяется на стороне сервера)
- hash = контрольная сумма от неупакованного содержимого xxh64
- uuid = 128 бит, уникальный идентификатор, формируется UUID v2 от хеша SHA256

Сценарии запросов:
- GET `if-none-match`=etag
- PUT `if-match`=etag

2. Быстрый ответ на вопрос есть ли объект с данным хешем в таблице 
3. Deduplicate - при записи нового объекта может понадобится поиск похожего по контрольной сумме. 

GQuark  - ассоциативный массив - найти объект по имени. в имени используются символы .[0-9a-z]

 */
/* Просмотр всех имен в графе и построение пространства имен 

- leaf - read-only тензоры с операцией NONE
    имя                 преобразуется в 
    blk.27.attn_v.bias  ("blk.*.attn_v.bias")[27]
    cache_k_l25         ("cache_k_l*")[25]
    OpenCL#leaf_5#0     ("OpenCL#leaf_*#0")[5]

[cname,indx] = ;
= _quark_lookup(namespace, )
Правила преобразования 

 */
